# Область ПрограммныйИнтерфейс 

//Добавили поле КонтактноеЛицо в формы документов и поле СогласованнаяСкидка
//
// Параметры:
//  Форма 	- ФормаКлиентскогоПриложения - форма документа, в которую надо добавить поле КонтактноеЛицо
//
Процедура ДополнитьФорму(Форма) Экспорт  
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо
	// ++ Лобанова ____ 12.09.2026: добавление поля СогласованнаяСкидка
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьГруппаСкидкаВГруппаШапкаЛево(Форма);  
		ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма); 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПередОснование(Форма);    
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПередСуммаДокумента(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	КонецЕсли; 
	//--
		
КонецПроцедуры    

#КонецОбласти  

# Область СлужебныеПроцедурыИФункции         

Процедура ДобавитьГруппаСкидкаВГруппаШапкаЛево(Форма)  
	
	// ++ Лобанова ____ 12.09.2026: Добавление группы формы для поля СогласованнаяСкидка
	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	ГруппаСкидка.ОтображатьЗаголовок = Ложь;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСкидка.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;     
	//--
	
КонецПроцедуры      

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма)    
	
	// ++ Лобанова ____ 12.09.2026: Добавление поля СогласованнаяСкидка в группу ГруппаСкидка
	ПолеВвода = Форма.Элементы.Добавить("ДП_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_СогласованнаяСкидка"; 
	ПолеВвода.Заголовок = "Согласованная скидка";  
	//--
	
КонецПроцедуры   
	
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо в ГруппаШапкаПраво
	ПолеВвода = Форма.Элементы.Добавить("ДП_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо";   
	//--
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПередОснование(Форма)
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо перед Основанием
	ПолеВвода = Форма.Элементы.Вставить("ДП_КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";	  
	ПолеВвода.Заголовок = "Контактное лицо";  
	//--
	
КонецПроцедуры    

Процедура ВставитьПолеКонтактноеЛицоПередСуммаДокумента(Форма)
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо перед СуммойДокумента
	ПолеВвода = Форма.Элементы.Вставить("ДП_КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";	
	ПолеВвода.Заголовок = "Контактное лицо"; 
	//--
	
КонецПроцедуры

# КонецОбласти