# Область ПрограммныйИнтерфейс 

//Добавили поле КонтактноеЛицо в формы документов
//
// Параметры:
//  Форма 	- ФормаКлиентскогоПриложения - форма документа, в которую надо добавить поле КонтактноеЛицо
//
Процедура ДополнитьФорму(Форма) Экспорт  
	
	// ++ Лобанова ____ 11.09.2026: добавление полей форм
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПередОснование(Форма);    
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПередСуммаДокумента(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	КонецЕсли; 
	//--
		
КонецПроцедуры    

#КонецОбласти  

# Область СлужебныеПроцедурыИФункции            
	
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо в ГруппаШапкаПраво
	ПолеВвода = Форма.Элементы.Добавить("ДП_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо";   
	//--
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПередОснование(Форма)
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо перед Основанием
	ПолеВвода = Форма.Элементы.Вставить("ДП_КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";	  
	ПолеВвода.Заголовок = "Контактное лицо";  
	//--
	
КонецПроцедуры    

Процедура ВставитьПолеКонтактноеЛицоПередСуммаДокумента(Форма)
	
	// ++ Лобанова ____ 11.09.2026: добавление поля КонтактноеЛицо перед СуммойДокумента
	ПолеВвода = Форма.Элементы.Вставить("ДП_КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДП_КонтактноеЛицо";	
	ПолеВвода.Заголовок = "Контактное лицо"; 
	//--
	
КонецПроцедуры

# КонецОбласти