#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	// ++ Лобанова ____ 11.09.2026: Добавление полей представления
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");  
	Поля.Добавить("ДействуетНаОсновании");   
	//--
		
КонецПроцедуры     

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)  
	
	// ++ Лобанова ____ 11.09.2026: Изменение представления
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании);       
	КонецЕсли;  
	//--
	
КонецПроцедуры

#КонецОбласти
